datboip/ESP32Marauder/esp32_marauder/MenuFunctions.cpp
void MenuFunctions::displayCurrentMenu(int start_index)
{
  //Serial.println(F("Displaying current menu..."));
  display_obj.clearScreen();
  display_obj.updateBanner(current_menu->name);
  display_obj.tft.setTextColor(TFT_LIGHTGREY, TFT_DARKGREY);
  this->drawStatusBar();

  if (current_menu->list != NULL)
  {
    #ifdef HAS_FULL_SCREEN
      display_obj.tft.setFreeFont(MENU_FONT);
    #endif

    #ifdef HAS_MINI_SCREEN
      display_obj.tft.setFreeFont(NULL);
      display_obj.tft.setTextSize(1);
    #endif

    for (uint16_t i = start_index; i < min(start_index + BUTTON_SCREEN_LIMIT, current_menu->list->size()); i++)
    {
      if (!current_menu || !current_menu->list || i >= current_menu->list->size())
        continue;
      uint16_t color = this->getColor(current_menu->list->get(i).color);
      #ifdef HAS_FULL_SCREEN
        if ((current_menu->list->get(i).selected) || (current_menu->selected == i)) {
          display_obj.key[i - start_index].drawButton(true, current_menu->list->get(i).name);
        }
        else {
          display_obj.key[i - start_index].drawButton(false, current_menu->list->get(i).name);          
        }
        
        if ((current_menu->list->get(i).name != text09) && (current_menu->list->get(i).icon != 255))
          display_obj.tft.drawXBitmap(0,
                                      KEY_Y + (i - start_index) * (KEY_H + KEY_SPACING_Y) - (ICON_H / 2),
                                      menu_icons[current_menu->list->get(i).icon],
                                      ICON_W,
                                      ICON_H,
                                      TFT_BLACK,
                                      color);

      #endif

      #ifdef HAS_MINI_SCREEN
        if ((current_menu->selected == i) || (current_menu->list->get(i).selected))
          this->drawMiniMenuButton(i - start_index, i, true);
        else 
          this->drawMiniMenuButton(i - start_index, i, false);
      #endif
    }
    display_obj.tft.setFreeFont(NULL);
  }

  this->displayMenuButtons();
}

// ============================================================
// BRIGHTNESS ADJUSTMENT MODE
// Hold top/bottom 2.5s to enter. TAP TOP = brighter, TAP BOTTOM = dimmer.
// Hold anywhere 3s = darkening countdown → blackout.
// Auto-save after 4s idle.
// ============================================================
#ifndef HAS_MINI_SCREEN
  void MenuFunctions::brightnessMode() {
    extern void brightnessSave(uint8_t level);
    extern uint8_t getBrightnessLevel();

    const uint8_t levels[] = {3, 8, 15, 26, 51, 77, 102, 128, 153, 179, 204, 230, 255};
    const uint8_t numLevels = 13;
    uint8_t level = getBrightnessLevel();

    // LEDC write compatibility (2.x vs 3.x board package)
    #if ESP_ARDUINO_VERSION_MAJOR >= 3
      #define BL_PREVIEW(duty) ledcWrite(TFT_BL, (duty))
    #else
      #define BL_PREVIEW(duty) ledcWrite(0, (duty))
    #endif

    // Restore backlight to saved level (entry gesture leaves it dimmed)
    BL_PREVIEW(levels[level]);

    display_obj.tft.fillScreen(TFT_BLACK);
    display_obj.tft.setTextColor(TFT_CYAN, TFT_BLACK);
    display_obj.tft.drawCentreString("BRIGHTNESS", TFT_WIDTH/2, 30, 2);

    display_obj.tft.setTextColor(TFT_LIGHTGREY, TFT_BLACK);
    display_obj.tft.drawCentreString("TAP TOP = BRIGHTER", TFT_WIDTH/2, 10, 1);
    display_obj.tft.drawCentreString("TAP BOTTOM = DIMMER", TFT_WIDTH/2, TFT_HEIGHT - 30, 1);
    display_obj.tft.setTextColor(TFT_RED, TFT_BLACK);
    display_obj.tft.drawCentreString("HOLD = BLACKOUT", TFT_WIDTH/2, TFT_HEIGHT - 15, 1);

    auto drawBar = [&]() {
      uint16_t barX = 30, barY = TFT_HEIGHT/2 - 25, barW = TFT_WIDTH - 60, barH = 30;
      display_obj.tft.drawRect(barX, barY, barW, barH, TFT_WHITE);
      uint16_t fillW = (barW - 4) * (level + 1) / numLevels;
      display_obj.tft.fillRect(barX + 2, barY + 2, barW - 4, barH - 4, TFT_BLACK);
      display_obj.tft.fillRect(barX + 2, barY + 2, fillW, barH - 4, TFT_CYAN);
      display_obj.tft.fillRect(0, barY + barH + 5, TFT_WIDTH, 20, TFT_BLACK);
      display_obj.tft.setTextColor(TFT_WHITE, TFT_BLACK);
      String pct = String(levels[level] * 100 / 255) + "%";
      display_obj.tft.drawCentreString(pct, TFT_WIDTH/2, barY + barH + 8, 2);
    };
    drawBar();

    uint16_t zoneSplit = TFT_HEIGHT / 2;
    // Drain any ongoing touch from entry gesture before starting loop
    { uint16_t dx, dy; while (display_obj.updateTouch(&dx, &dy)) delay(10); }
    uint32_t lastTouch = millis();

    while (true) {
      // Auto-save after 4s of no touch
      if (millis() - lastTouch >= 4000) {
        brightnessSave(level);
        break;
      }

      uint16_t tx, ty;
      if (display_obj.updateTouch(&tx, &ty)) {
        lastTouch = millis();
        uint32_t hold_start = millis();
        uint8_t darken_stage = 0;
        uint8_t saved_duty = levels[level];
        bool blacked_out = false;

        // Track hold duration while finger is down
        while (display_obj.updateTouch(&tx, &ty)) {
          uint32_t held_ms = millis() - hold_start;

          // Darkening countdown: dim backlight each second toward blackout
          if (held_ms >= 1000 && darken_stage == 0) {
            darken_stage = 1;
            BL_PREVIEW(saved_duty * 2 / 3);
          }
          if (held_ms >= 2000 && darken_stage == 1) {
            darken_stage = 2;
            BL_PREVIEW(saved_duty / 3);
          }
          if (held_ms >= 3000 && darken_stage == 2) {
            // Save current level then blackout
            brightnessSave(level);
            extern void backlightOff();
            backlightOff();
            this->screen_blacked_out = true;
            blacked_out = true;
            break;
          }
          delay(10);
        }

        if (blacked_out) {
          // Wait for release then exit
          while (display_obj.updateTouch(&tx, &ty)) delay(10);
          break;
        }

        // Released before 3s — restore brightness and handle as tap
        BL_PREVIEW(saved_duty);

        if (ty < zoneSplit) {
          // Top half = brighter
          if (level < numLevels - 1) {
            level++;
            BL_PREVIEW(levels[level]);
            drawBar();
          }
        } else {
          // Bottom half = dimmer
          if (level > 0) {
            level--;
            BL_PREVIEW(levels[level]);
            drawBar();
          }
        }
        lastTouch = millis();
        delay(150);
      }
      delay(30);
    }

    #undef BL_PREVIEW
    this->changeMenu(current_menu, true);
  }
#endif

