datboip/ESP32Marauder/esp32_marauder/MenuFunctions.cpp
// ============================================================
// AUTOCYCLE STATUS SCREEN
// Draws current mode, progress bar, time remaining, cycle count
// ============================================================
void MenuFunctions::returnToMainMenu() {
  display_obj.init();
  this->changeMenu(&mainMenu, true);
}

// Fullscreen AutoCycle status — blocks until user taps to stop
void MenuFunctions::drawAutoCycleStatus() {
  if (!auto_cycle_obj.isRunning()) return;

  display_obj.clearScreen();

  // Header
  display_obj.tft.setTextColor(TFT_CYAN, TFT_BLACK);
  display_obj.tft.drawCentreString("AUTOCYCLE", TFT_WIDTH/2, 10, 2);

  // Layout constants
  const uint16_t modeY = 50;
  const uint16_t barY = 90;
  const uint16_t barH = 20;
  const uint16_t barX = 20;
  const uint16_t barW = TFT_WIDTH - 40;
  const uint16_t timeY = 120;
  const uint16_t stepY = 155;
  const uint16_t cycleY = 185;
  const uint16_t stopY = 240;

  display_obj.tft.setTextColor(TFT_DARKGREY, TFT_BLACK);
  display_obj.tft.drawCentreString("tap anywhere to stop", TFT_WIDTH/2, stopY, 2);

  const char* prevLabel = "";
  uint16_t prevElapsed = 0xFFFF;
  uint16_t prevCycle = 0xFFFF;
  uint8_t prevIndex = 0xFF;

  while (auto_cycle_obj.isRunning()) {
    auto_cycle_obj.main(millis());

    const char* label = auto_cycle_obj.getCurrentLabel();
    uint16_t elapsed = auto_cycle_obj.getElapsedSec();
    uint16_t duration = auto_cycle_obj.getCurrentDuration();
    uint16_t color = auto_cycle_obj.getCurrentColor();
    uint8_t idx = auto_cycle_obj.getCurrentIndex();
    uint16_t cycles = auto_cycle_obj.getCycleCount();

    if (label != prevLabel) {
      display_obj.tft.fillRect(0, modeY, TFT_WIDTH, 30, TFT_BLACK);
      display_obj.tft.setTextColor(color, TFT_BLACK);
      display_obj.tft.drawCentreString(label, TFT_WIDTH/2, modeY, 4);
      prevLabel = label;
      prevElapsed = 0xFFFF;
    }

    if (elapsed != prevElapsed) {
      display_obj.tft.drawRect(barX, barY, barW, barH, TFT_WHITE);
      uint16_t fillW = 0;
      if (duration > 0) fillW = (uint32_t)(barW - 2) * elapsed / duration;
      if (fillW > barW - 2) fillW = barW - 2;
      display_obj.tft.fillRect(barX + 1, barY + 1, fillW, barH - 2, color);
      display_obj.tft.fillRect(barX + 1 + fillW, barY + 1, barW - 2 - fillW, barH - 2, TFT_BLACK);

      display_obj.tft.fillRect(0, timeY, TFT_WIDTH, 20, TFT_BLACK);
      char timeBuf[24];
      snprintf(timeBuf, sizeof(timeBuf), "%ds / %ds", elapsed, duration);
      display_obj.tft.setTextColor(TFT_WHITE, TFT_BLACK);
      display_obj.tft.drawCentreString(timeBuf, TFT_WIDTH/2, timeY, 2);
      prevElapsed = elapsed;
    }

    if (idx != prevIndex) {
      display_obj.tft.fillRect(0, stepY, TFT_WIDTH, 20, TFT_BLACK);
      char stepBuf[16];
      snprintf(stepBuf, sizeof(stepBuf), "Step %d / %d", idx + 1, auto_cycle_obj.getNumModes());
      display_obj.tft.setTextColor(TFT_LIGHTGREY, TFT_BLACK);
      display_obj.tft.drawCentreString(stepBuf, TFT_WIDTH/2, stepY, 2);
      prevIndex = idx;
    }

    if (cycles != prevCycle) {
      display_obj.tft.fillRect(0, cycleY, TFT_WIDTH, 20, TFT_BLACK);
      char cycleBuf[24];
      snprintf(cycleBuf, sizeof(cycleBuf), "Cycle #%d", cycles + 1);
      display_obj.tft.setTextColor(TFT_DARKGREY, TFT_BLACK);
      display_obj.tft.drawCentreString(cycleBuf, TFT_WIDTH/2, cycleY, 2);
      prevCycle = cycles;
    }

    uint16_t tx, ty;
    if (display_obj.updateTouch(&tx, &ty)) {
      while (display_obj.updateTouch(&tx, &ty)) delay(10);
      auto_cycle_obj.stop();
      break;
    }

    buffer_obj.save();
    delay(100);
  }

  display_obj.clearScreen();
  this->changeMenu(&mainMenu, true);
}

#endif



